{
  "appName": {
    "message": "MD ל-PDF"
  },
  "shortDesc": {
    "message": "השתמש ב-MD ל-PDF כדי להמיר קובץ .md ל-PDF באופן מקוון, לייצא markdown ל-PDF ולקמפל קבצי markdown במהירות."
  },
  "storeDesc": {
    "message": "📝 Md ל-pdf הוא תוסף רב עוצמה ומעשי לגוגל כרום, שנועד להמרת מסמכי markdown מהירה ומדויקת. אם אתם עובדים באופן קבוע עם קבצי markdown וזקוקים לפתרון יציב של .md ל-pdf ישירות בדפדפן שלכם, כלי זה מכסה את כל תהליך העבודה. תוכלו להמיר בקלות md ל-pdf מבלי להתקין תוכנה נוספת או להשתמש בשירותים חיצוניים.\n\n ⚡ ההרחבה מתמקדת בהמרה אמינה מקבצי .md ל-.pdf עם תמיכה מלאה בתחביר markdown. כותרות, רשימות, בלוקי קוד, טבלאות ועיצוב נשמרים במהלך הייצוא. MD ל-PDF פועל כממיר ייעודי מ-md ל-pdf שנבנה במיוחד עבור מפתחים, כותבים וצוותים טכניים.\n\n 📌 יתרונות השימוש בממיר markdown ל-PDF:\n 1️⃣ היררכיה נכונה של כותרות\n 2️⃣ רינדור נכון של רשימה וטבלה\n 3️⃣ בלוקי קוד עם שמירה על ריווח\n 4️⃣ זמן עיבוד מהיר\n 5️⃣ ממשק מינימליסטי ואינטואיטיבי\n\n 🚀 התוסף מותאם למהירות ולשימוש יומיומי. הוא פותח עורך סימונים בכרטיסייה חדשה, שם ניתן לכתוב, להעלות או לגרור ולשחרר קבצי .md ולהציג אותם בתצוגה מקדימה בזמן אמת. זה הופך את המרת md ל-PDF באינטרנט לבטוחה, נוחה וניתנת להתאמה אישית מלאה בהתאם להגדרות התצוגה המקדימה שלכם.\n\n 📌 מקרי שימוש:\n 🔸 המר קובץ md ל-PDF עבור מדריכים, מדריכים והערות פרויקט מובנות.\n 🔸 ייצוא תוכן עם הנחה ממאמרים תוך שמירה על הפריסה והעיצוב.\n 🔸 קומפילציה של md ל-pdf, שמירה על כותרות, טבלאות ובלוקים של קוד.\n\n 💻 בעזרת תוסף זה, תוכלו להמיר קובץ .md ל-pdf מקבצים מקומיים או ממקורות מקוונים. זה כולל מאגרי GitHub, דפי תיעוד ופלטפורמות מבוססות markdown. היכולת להמיר כל קובץ md ל-pdf באופן מיידי הופכת את תהליכי העבודה לפשוטים ויעילים.\n\n 📄 ‏Md ל-PDF אידיאלי עבור:\n ➤ תיעוד טכני\n ➤ קבצי README\n ➤ מדריכים למפתחים\n ➤ הערות לימוד\n ➤ דוחות פרויקט\n\n 🛠️ בניגוד לממירים גנריים, עיבוד מקוון של md ל-PDF כאן מותאם במיוחד ל-markdown. מנוע הרינדור מבין לעומק את תחביר markdown, מה שמאפשר לך לקמפל md ל-PDF ללא פריסות פגומות או בעיות עיצוב.\n\n ✨ מי יכול להפיק תועלת מהכלי הזה:\n - מפתחים הזקוקים להמרה מדויקת של קבצי README כאשר כל העיצוב נשמר.\n - כותבים טכניים הממירים קבצי PDF של markdown למסמכים מקצועיים עבור לקוחות או צוותים.\n - סטודנטים מייצאים הערות עבור מטלות, סיכומים ופרויקטים שיתופיים.\n - יוצרי תוכן המשתמשים בממיר markdown כדי להפוך במהירות טיוטות למסמכים מקצועיים.\n - צוותים המרכיבים קבצי md לפורמט pdf עבור תיעוד, ויקי פנימי ומאגרי ידע שיתופיים.\n\n 🔗 ווידג&#39;ט לקישורי Markdown\n תוסף כרום זה מוסיף ווידג&#39;ט שימושי לכל הקישורים בתוצאות החיפוש שמצביעים על קבצי markdown. בלחיצה אחת, תוכלו לפתוח את הקישור בעורך, לראות תצוגה מקדימה חיה באופן מיידי ולהמיר קובץ .md ל-PDF בשלב אחד. התצוגה המקדימה ניתנת להתאמה אישית מלאה - ניתן להתאים גופנים, צבעים וריווח - וקובץ ה-PDF המיוצא יתאים בדיוק להגדרות שלכם.\n\n 🖇️ תכונות הווידג&#39;ט:\n 1. פתח קבצי markdown מקישורים באופן מיידי\n 2. השתמשו ב- converter md להמרות מהירות\n 3. תצוגה מקדימה חיה בצד ימין של העורך\n 4. התאמה אישית של סגנונות גופנים, ריווח שורות וצבעים\n 5. המר קובץ .md ל-pdf בלחיצה אחת\n\n\n 📘 שאלות נפוצות\n ❓ כיצד עובד תהליך ההמרה?\n 💡 התוסף פותח עורך ייעודי שבו ניתן לטעון מסמכים מבוססי טקסט, להציג תצוגה מקדימה של התוצאה באופן מיידי ולייצא את הקובץ הסופי עם מבנה וסגנון שנשמרו.\n\n ❓ האם ניתן לייצא קבצים מבלי להשתמש בשירותי צד שלישי?\n 💡 כן. כל העיבוד מתרחש ישירות בתוך הדפדפן, כך שתוכלו להמיר md ל-PDF באופן מקוון מבלי להעלות תוכן לפלטפורמות חיצוניות.\n\n ❓ האם העיצוב נשמר במהלך הייצוא?\n 💡 כן. כותרות, טבלאות, רשימות וקטעי קוד נשארים עקביים, מה שמאפשר לך לייצא md ל-pdf ללא בעיות פריסה.\n\n ❓ האם הכלי תומך בקבצים ממקורות מקוונים?\n 💡 בהחלט. ניתן לפתוח מסמכים ממאגרים או מדפי תיעוד ולהפוך אותם לפורמט מוכן לשיתוף באמצעות מנוע הממיר המובנה md.\n\n ❓ האם פתרון זה מתאים למשתמשים שאינם טכניים?\n 💡 כן. הממשק פשוט ואינטואיטיבי, מה שהופך את ההמרה המקוונת של markdown ל-PDF לנגישה לסטודנטים, כותבים וצוותים.\n\n ❓ האם ניתן להתאים אישית את הפלט הסופי?\n 💡 ניתן להתאים גופנים, מרווחים וצבעים בתצוגה המקדימה לפני הייצוא, ולוודא שהתוצאה תואמת את הציפיות שלך בעת ההמרה ל-PDF.\n\n 🧩 לסיכום, כלי זה בנוי לזרימות עבודה מהירות וצפויות של מסמכים. הוא עוזר לך להתמודד במהירות עם משימות של הפיכת קבצי mardown ל-PDF, להשתמש בכלי ממיר קל משקל של md, ולעבד קבצי mardown ל-PDF עם עיצוב עקבי ישירות בדפדפן שלך.\n"
  }
}