{
  "appName": {
    "message": "mdファイルをpdf出力 - MD to PDF"
  },
  "shortDesc": {
    "message": "MDをPDFにを使用して、.mdファイルをオンラインでPDFに変換し、マークダウンをPDFにエクスポートし、マークダウンファイルを迅速にコンパイルします。"
  },
  "storeDesc": {
    "message": "📝 MDをPDFには、迅速かつ正確なマークダウン文書変換のために設計された強力で実用的なGoogle Chrome拡張機能です。マークダウンファイルを定期的に扱い、ブラウザ内で直接安定した.mdからpdfへのソリューションが必要な場合、このツールはワークフロー全体をカバーします。追加のソフトウェアをインストールしたり、外部サービスを使用したりすることなく、簡単にmdをpdfに変換できます。\n\n⚡ この拡張機能は、マークダウン構文を完全にサポートした信頼性の高い.mdから.pdfへの変換に焦点を当てています。ヘッダー、リスト、コードブロック、テーブル、フォーマットは、エクスポート中に保持されます。MDをPDFには、開発者、ライター、技術チームのために特別に構築された専用のmdからpdfへのコンバータとして機能します。\n\n📌 マークダウンからpdfへのコンバータを使用する利点：\n1️⃣ 適切な見出し階層\n2️⃣ 正しいリストとテーブルのレンダリング\n3️⃣ スペースを保持したコードブロック\n4️⃣ 高速な処理時間\n5️⃣ 最小限で直感的なインターフェース\n\n🚀 この拡張機能は、速度と日常使用のために最適化されています。新しいタブでマークダウンエディタを開き、.mdファイルを記述、アップロード、またはドラッグ＆ドロップしてリアルタイムでプレビューできます。これにより、オンラインでmdをpdfに変換することが安全で便利になり、プレビュー設定に応じて完全にカスタマイズ可能です。\n\n📌 使用例：\n🔸 マニュアル、ガイド、構造化されたプロジェクトノートのためにmdファイルをpdfに変換。\n🔸 レイアウトとフォーマットを保持しながら、記事からマークダウンコンテンツをエクスポート。\n🔸 見出し、テーブル、コードブロックを維持しながらmdをpdfにコンパイル。\n\n💻 この拡張機能を使用すると、ローカルファイルやオンラインソースから.mdをpdfに変換できます。これには、GitHubリポジトリ、ドキュメントページ、マークダウンベースのプラットフォームが含まれます。任意のmdファイルを瞬時にpdfに変換できる能力は、ワークフローをシンプルで効率的にします。\n\n📄 MDをPDFには、以下に最適です：\n➤ 技術文書\n➤ READMEファイル\n➤ 開発者ガイド\n➤ 学習ノート\n➤ プロジェクトレポート\n\n🛠️ 一般的なコンバータとは異なり、ここでのオンラインmdからpdfへの処理は、マークダウン専用に調整されています。レンダリングエンジンはマークダウン構文を深く理解しており、レイアウトやフォーマットの問題なしにmdをpdfにコンパイルできます。\n\n✨ このツールの恩恵を受けることができる人：\n- すべてのフォーマットを保持して正確にREADMEファイルを変換する必要がある開発者。\n- クライアントやチームのためにマークダウンpdfファイルをプロフェッショナルな文書に変換する技術ライター。\n- 課題、要約、共同プロジェクトのためにノートをエクスポートする学生。\n- 草案を迅速にプロフェッショナルな文書に変換するためにマークダウンコンバータを使用するコンテンツクリエイター。\n- ドキュメント、内部ウィキ、共同知識ベースのためにmdファイルをpdfにコンパイルするチーム。\n\n🔗 マークダウンリンク用ウィジェット\nこのChrome拡張機能は、マークダウンファイルを指す検索結果のすべてのリンクに便利なウィジェットを追加します。ワンクリックでリンクをエディタで開き、ライブプレビューを即座に確認し、1ステップで.mdファイルをpdfに変換できます。プレビューは完全にカスタマイズ可能で、フォント、色、スペースを調整でき、エクスポートされたPDFは設定に正確に一致します。\n\n🖇️ ウィジェットの機能：\n1. リンクからマークダウンファイルを即座に開く\n2. 迅速な変換のためにmdコンバータを使用\n3. エディタの右側にライブプレビュー\n4. フォントスタイル、行間、色をカスタマイズ\n5. ワンクリックで.mdファイルをpdfに変換\n\n📘 よくある質問\n❓ 変換プロセスはどのように機能しますか？\n💡 この拡張機能は、テキストベースの文書を読み込み、結果を即座にプレビューし、構造とスタイルを保持したまま最終ファイルをエクスポートできる専用エディタを開きます。\n\n❓ サードパーティサービスを使用せずにファイルをエクスポートできますか？\n💡 はい。すべての処理はブラウザ内で直接行われるため、外部プラットフォームにコンテンツをアップロードすることなく、オンラインでmdをpdfに変換できます。\n\n❓ エクスポート中にフォーマットは保持されますか？\n💡 はい。見出し、テーブル、リスト、コードセクションは一貫して保持され、レイアウトの問題なしにmdをpdfにエクスポートできます。\n\n❓ このツールはオンラインソースからのファイルをサポートしていますか？\n💡 もちろんです。リポジトリやドキュメントページから文書を開き、内蔵のmdコンバータエンジンを使用して共有可能な形式に変換できます。\n\n❓ このソリューションは非技術的なユーザーに適していますか？\n💡 はい。インターフェースはシンプルで直感的であり、学生、ライター、チームがオンラインでマークダウンからpdfへの変換を行うことができます。\n\n❓ 最終出力をカスタマイズできますか？\n💡 エクスポート前にプレビューでフォント、スペース、色を調整できるため、mdをpdfに変換する際に結果が期待に合致することを保証します。\n\n🧩 要約すると、このツールは迅速で予測可能な文書ワークフローのために構築されています。マークダウンからpdfへのタスクを迅速に処理し、軽量のmdコンバータを使用し、ブラウザ内で一貫したフォーマットのマークダウンからpdfファイルを処理するのに役立ちます。"
  }
}