{
  "appName": {
    "message": "MD σε PDF"
  },
  "shortDesc": {
    "message": "Χρησιμοποιήστε το MD σε PDF για να μετατρέψετε αρχεία .md σε PDF online, να εξάγετε markdown σε PDF και να συντάξετε αρχεία markdown γρήγορα."
  },
  "storeDesc": {
    "message": "📝 MD σε PDF είναι μια ισχυρή και πρακτική επέκταση του Google Chrome σχεδιασμένη για γρήγορη και ακριβή μετατροπή εγγράφων markdown. Αν εργάζεστε τακτικά με αρχεία markdown και χρειάζεστε μια σταθερή λύση .md σε PDF απευθείας στον περιηγητή σας, αυτό το εργαλείο καλύπτει όλη τη ροή εργασίας. Μπορείτε εύκολα να μετατρέψετε md σε PDF χωρίς να εγκαταστήσετε πρόσθετο λογισμικό ή να χρησιμοποιήσετε εξωτερικές υπηρεσίες.\n\n⚡ Η επέκταση επικεντρώνεται σε αξιόπιστη μετατροπή .md σε .pdf με πλήρη υποστήριξη της σύνταξης markdown. Οι επικεφαλίδες, οι λίστες, τα μπλοκ κώδικα, οι πίνακες και η μορφοποίηση διατηρούνται κατά την εξαγωγή. MD σε PDF λειτουργεί ως ένας ειδικός μετατροπέας md σε PDF που έχει κατασκευαστεί ειδικά για προγραμματιστές, συγγραφείς και τεχνικές ομάδες.\n\n📌 Οφέλη από τη χρήση του μετατροπέα markdown σε PDF:\n1️⃣ Σωστή ιεραρχία επικεφαλίδων\n2️⃣ Σωστή απόδοση λιστών και πινάκων\n3️⃣ Μπλοκ κώδικα με διατήρηση του διαστήματος\n4️⃣ Γρήγορος χρόνος επεξεργασίας\n5️⃣ Ελάχιστη και διαισθητική διεπαφή\n\n🚀 Η επέκταση είναι βελτιστοποιημένη για ταχύτητα και καθημερινή χρήση. Ανοίγει έναν επεξεργαστή markdown σε μια νέα καρτέλα, όπου μπορείτε να γράψετε, να ανεβάσετε ή να σύρετε και να αποθέσετε αρχεία .md και να τα προβάλετε σε πραγματικό χρόνο. Αυτό καθιστά τη μετατροπή md σε PDF online ασφαλή, βολική και πλήρως προσαρμόσιμη σύμφωνα με τις ρυθμίσεις προεπισκόπησής σας.\n\n📌 Χρήσεις:\n🔸 Μετατροπή αρχείου md σε PDF για εγχειρίδια, οδηγούς και δομημένες σημειώσεις έργων.\n🔸 Εξαγωγή περιεχομένου markdown από άρθρα διατηρώντας τη διάταξη και τη μορφοποίηση.\n🔸 Συγκέντρωση md σε PDF, διατηρώντας τις επικεφαλίδες, τους πίνακες και τα μπλοκ κώδικα.\n\n💻 Με αυτή την επέκταση, μπορείτε να μετατρέψετε .md σε PDF από τοπικά αρχεία ή διαδικτυακές πηγές. Αυτό περιλαμβάνει αποθετήρια GitHub, σελίδες τεκμηρίωσης και πλατφόρμες βασισμένες σε markdown. Η δυνατότητα να μετατρέψετε οποιοδήποτε αρχείο md σε PDF άμεσα καθιστά τις ροές εργασίας απλές και αποτελεσματικές.\n\n📄 MD σε PDF είναι ιδανικό για:\n➤ τεχνική τεκμηρίωση\n➤ αρχεία README\n➤ οδηγούς προγραμματιστών\n➤ σημειώσεις σπουδών\n➤ εκθέσεις έργων\n\n🛠️ Σε αντίθεση με γενικούς μετατροπείς, η διαδικτυακή επεξεργασία md σε PDF εδώ είναι προσαρμοσμένη ειδικά για markdown. Ο κινητήρας απόδοσης κατανοεί βαθιά τη σύνταξη markdown, επιτρέποντάς σας να συγκεντρώσετε md σε PDF χωρίς σπασμένες διατάξεις ή προβλήματα μορφοποίησης.\n\n✨ Ποιοι μπορούν να επωφεληθούν από αυτό το εργαλείο:\n- Προγραμματιστές που χρειάζονται αρχεία README μετατρεπόμενα με ακρίβεια με διατηρημένη όλη τη μορφοποίηση.\n- Τεχνικοί συγγραφείς που μετατρέπουν αρχεία markdown σε επαγγελματικά έγγραφα για πελάτες ή ομάδες.\n- Φοιτητές που εξάγουν σημειώσεις για εργασίες, περιλήψεις και συνεργατικά έργα.\n- Δημιουργοί περιεχομένου που χρησιμοποιούν τον μετατροπέα markdown για να μετατρέψουν γρήγορα προσχέδια σε επαγγελματικά έγγραφα.\n- Ομάδες που συγκεντρώνουν αρχεία md σε PDF για τεκμηρίωση, εσωτερικά wikis και συνεργατικές βάσεις γνώσεων.\n\n🔗 Widget για Συνδέσμους Markdown\nΑυτή η επέκταση chrome προσθέτει ένα χρήσιμο widget σε όλους τους συνδέσμους στα αποτελέσματα αναζήτησης που δείχνουν σε αρχεία markdown. Με ένα μόνο κλικ, μπορείτε να ανοίξετε το σύνδεσμο στον επεξεργαστή, να δείτε άμεσα μια ζωντανή προεπισκόπηση και να μετατρέψετε το αρχείο .md σε PDF σε ένα βήμα. Η προεπισκόπηση είναι πλήρως προσαρμόσιμη — μπορείτε να ρυθμίσετε τις γραμματοσειρές, τα χρώματα και τα διαστήματα — και το εξαγόμενο PDF θα ταιριάζει ακριβώς με τις ρυθμίσεις σας.\n\n🖇️ Χαρακτηριστικά widget:\n1. Άνοιγμα αρχείων markdown από συνδέσμους άμεσα\n2. Χρήση του μετατροπέα md για γρήγορες μετατροπές\n3. Ζωντανή προεπισκόπηση στη δεξιά πλευρά του επεξεργαστή\n4. Προσαρμογή στυλ γραμματοσειρών, διαστήματος γραμμών και χρωμάτων\n5. Μετατροπή αρχείου .md σε PDF με ένα κλικ\n\n📘 Συχνές Ερωτήσεις\n❓ Πώς λειτουργεί η διαδικασία μετατροπής;\n💡 Η επέκταση ανοίγει έναν ειδικό επεξεργαστή όπου μπορείτε να φορτώσετε κείμενα, να προβάλετε το αποτέλεσμα άμεσα και να εξάγετε το τελικό αρχείο με διατηρημένη δομή και στυλ.\n\n❓ Μπορώ να εξάγω αρχεία χωρίς να χρησιμοποιήσω υπηρεσίες τρίτων;\n💡 Ναι. Όλη η επεξεργασία γίνεται απευθείας μέσα στον περιηγητή, οπότε μπορείτε να μετατρέψετε md σε PDF online χωρίς να ανεβάσετε περιεχόμενο σε εξωτερικές πλατφόρμες.\n\n❓ Διατηρείται η μορφοποίηση κατά την εξαγωγή;\n💡 Ναι. Οι επικεφαλίδες, οι πίνακες, οι λίστες και οι ενότητες κώδικα παραμένουν συνεπείς, επιτρέποντάς σας να εξάγετε md σε PDF χωρίς προβλήματα διάταξης.\n\n❓ Υποστηρίζει το εργαλείο αρχεία από διαδικτυακές πηγές;\n💡 Απολύτως. Μπορείτε να ανοίξετε έγγραφα από αποθετήρια ή σελίδες τεκμηρίωσης και να τα μετατρέψετε σε μορφή έτοιμη προς κοινή χρήση χρησιμοποιώντας τον ενσωματωμένο κινητήρα μετατροπής md.\n\n❓ Είναι αυτή η λύση κατάλληλη για μη τεχνικούς χρήστες;\n💡 Ναι. Η διεπαφή είναι απλή και διαισθητική, καθιστώντας τη μετατροπή markdown σε PDF online προσβάσιμη για φοιτητές, συγγραφείς και ομάδες.\n\n❓ Μπορώ να προσαρμόσω την τελική έξοδο;\n💡 Μπορείτε να ρυθμίσετε τις γραμματοσειρές, τα διαστήματα και τα χρώματα στην προεπισκόπηση πριν από την εξαγωγή, διασφαλίζοντας ότι το αποτέλεσμα ταιριάζει με τις προσδοκίες σας όταν μετατρέπετε markdown σε PDF.\n\n🧩 Συνοψίζοντας, αυτό το εργαλείο έχει σχεδιαστεί για γρήγορες και προβλέψιμες ροές εργασίας εγγράφων. Σας βοηθά να διαχειρίζεστε γρήγορα τις εργασίες μετατροπής markdown σε PDF, να χρησιμοποιείτε έναν ελαφρύ μετατροπέα md και να επεξεργάζεστε αρχεία markdown σε PDF με συνεπή μορφοποίηση απευθείας στον περιηγητή σας."
  }
}